In [1]:
import pandas as pd

#data de nomes 
data = {'nome': ['Ana', 'Bruno', 'Carlos', 'Daniela'],
        'idade': [25, 30, 35, 40],
        'cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Brasília']}

df = pd.DataFrame(data)
df

      nome  idade          cidade
0      Ana     25       São Paulo
1    Bruno     30  Rio de Janeiro
2   Carlos     35  Belo Horizonte
3  Daniela     40        Brasília

In [2]:
data = {'nome': ['Ana', 'Bruno', 'Carlos', 'Daniela'],
        'idade': [25, 30, 35, 40],
        'cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Brasília']}

df = pd.DataFrame(data)
df.head() # mostra os dados de cima

      nome  idade          cidade
0      Ana     25       São Paulo
1    Bruno     30  Rio de Janeiro
2   Carlos     35  Belo Horizonte
3  Daniela     40        Brasília

In [3]:
data = {'nome': ['Ana', 'Bruno', 'Carlos', 'Daniela', 'Eduardo', 'Fábio', 'Giovana', 'Hugo', 'Isabela', 'João'],
        'idade': [25, 30, 35, 40, 45, 50, 55, 60, 65, 70],
        'cidade': ['São Paulo', 'Rio de Janeiro', 'Belo Horizonte', 'Brasília', 'Salvador', 'Fortaleza', 'Manaus', 'Curitiba', 'Recife', 'Porto Alegre']}

df = pd.DataFrame(data)
df.tail()

      nome  idade        cidade
5    Fábio     50     Fortaleza
6  Giovana     55        Manaus
7     Hugo     60      Curitiba
8  Isabela     65        Recife
9     João     70  Porto Alegre